-- The MIT License (MIT)

-- Copyright (c) 2021 Ilya Miller

-- Permission is hereby granted, free of charge, to any person obtaining a copy
-- of this software and associated documentation files (the "Software"), to deal
-- in the Software without restriction, including without limitation the rights
-- to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
-- copies of the Software, and to permit persons to whom the Software is
-- furnished to do so, subject to the following conditions:

-- The above copyright notice and this permission notice shall be included in
-- all copies or substantial portions of the Software.

-- THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
-- IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
-- FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
-- AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
-- LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
-- OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
-- THE SOFTWARE.

local MAJOR_VERSION = 'LibDiacritics';
local MINOR_VERSION = 2;

local LibDiacritics;

if LibStub then
    local lib, minor = LibStub:GetLibrary(MAJOR_VERSION, true);
    if lib and minor and minor >= MINOR_VERSION then
        return lib;
    else
        LibDiacritics = LibStub:NewLibrary(MAJOR_VERSION, MINOR_VERSION);
    end
else
    LibDiacritics = {};
end

local Diacritics = {
    -- A
    ['Á'] = 'A',    ['á'] = 'a',
    ['Ă'] = 'A',    ['ă'] = 'a',
    ['Ắ'] = 'A',    ['ắ'] = 'a',
    ['Ặ'] = 'A',    ['ặ'] = 'a',
    ['Ằ'] = 'A',    ['ằ'] = 'a',
    ['Ẳ'] = 'A',    ['ẳ'] = 'a',
    ['Ẵ'] = 'A',    ['ẵ'] = 'a',
    ['Ǎ'] = 'A',    ['ǎ'] = 'a',
    ['Â'] = 'A',    ['â'] = 'a',
    ['Ấ'] = 'A',    ['ấ'] = 'a',
    ['Ậ'] = 'A',    ['ậ'] = 'a',
    ['Ầ'] = 'A',    ['ầ'] = 'a',
    ['Ẩ'] = 'A',    ['ẩ'] = 'a',
    ['Ẫ'] = 'A',    ['ẫ'] = 'a',
    ['Ä'] = 'A',    ['ä'] = 'a',
    ['Ạ'] = 'A',    ['ạ'] = 'a',
    ['À'] = 'A',    ['à'] = 'a',
    ['Ả'] = 'A',    ['ả'] = 'a',
    ['Ā'] = 'A',    ['ā'] = 'a',
    ['Ą'] = 'A',    ['ą'] = 'a',
    ['Å'] = 'A',    ['å'] = 'a',
    ['Ǻ'] = 'A',    ['ǻ'] = 'a',
    ['Ã'] = 'A',    ['ã'] = 'a',
    ['Æ'] = 'AE',   ['æ'] = 'ae',
    ['Ǽ'] = 'AE',   ['ǽ'] = 'ae',

    -- B
    ['Ḅ'] = 'B',    ['ḅ'] = 'b',
    ['Ɓ'] = 'B',    ['ɓ'] = 'b',

    -- C
    ['Ć'] = 'C',    ['ć'] = 'c',
    ['Č'] = 'C',    ['č'] = 'c',
    ['Ç'] = 'C',    ['ç'] = 'c',
    ['Ĉ'] = 'C',    ['ĉ'] = 'c',
    ['Ċ'] = 'C',    ['ċ'] = 'c',

    -- D
    ['Ď'] = 'D',    ['ď'] = 'd',
    ['Ḓ'] = 'D',    ['ḓ'] = 'd',
    ['Ḍ'] = 'D',    ['ḍ'] = 'd',
    ['Ɗ'] = 'D',    ['ɗ'] = 'd',
    ['Ḏ'] = 'D',    ['ḏ'] = 'd',
    ['Đ'] = 'D',    ['đ'] = 'd',
    ['Ð'] = 'D',    ['ð'] = 'd', -- eth
    ['ǲ'] = 'Dz',   ['ǳ'] = 'dz',
    ['ǅ'] = 'Dz',   ['ǆ'] = 'dz',
    ['Ǳ'] = 'DZ',   ['ʣ'] = 'dz',
    ['Ǆ'] = 'DZ',
                    ['ɖ'] = 'd',
                    ['ʤ'] = 'dz',
                    ['ʥ'] = 'dz',

    -- E
    ['É'] = 'E',    ['é'] = 'e',
    ['Ĕ'] = 'E',    ['ĕ'] = 'e',
    ['Ě'] = 'E',    ['ě'] = 'e',
    ['Ê'] = 'E',    ['ê'] = 'e',
    ['Ế'] = 'E',    ['ế'] = 'e',
    ['Ệ'] = 'E',    ['ệ'] = 'e',
    ['Ề'] = 'E',    ['ề'] = 'e',
    ['Ể'] = 'E',    ['ể'] = 'e',
    ['Ễ'] = 'E',    ['ễ'] = 'e',
    ['Ë'] = 'E',    ['ë'] = 'e',
    ['Ė'] = 'E',    ['ė'] = 'e',
    ['Ẹ'] = 'E',    ['ẹ'] = 'e',
    ['È'] = 'E',    ['è'] = 'e',
    ['Ẻ'] = 'E',    ['ẻ'] = 'e',
    ['Ē'] = 'E',    ['ē'] = 'e',
    ['Ę'] = 'E',    ['ę'] = 'e',
    ['Ẽ'] = 'E',    ['ẽ'] = 'e',
    ['Ɛ'] = 'E',
    ['Ə'] = 'E',    ['ə'] = 'e',    ['ɚ'] = 'e', -- SCHWA
                    ['ʒ'] = 'e', -- EZH
                    ['ǯ'] = 'e', -- EZH
                    ['ʓ'] = 'e',
                    ['ɘ'] = 'e',
                    ['ɜ'] = 'e',
                    ['ɝ'] = 'e',
                    ['ʚ'] = 'e',
                    ['ɞ'] = 'e',

    -- F
    ['Ƒ'] = 'F',    ['ƒ'] = 'f',
                    ['ſ'] = 'f',
                    ['ʩ'] = 'f',
                    ['ﬁ'] = 'f',
                    ['ﬂ'] = 'f',
                    ['ʃ'] = 'f', -- ESH
                    ['ʆ'] = 'f', -- ESH
                    ['ʅ'] = 'f', -- ESH REVERSED

    -- G
    ['Ǵ'] = 'G',    ['ǵ'] = 'g',
    ['Ğ'] = 'G',    ['ğ'] = 'g',
    ['Ǧ'] = 'G',    ['ǧ'] = 'g',
    ['Ģ'] = 'G',    ['ģ'] = 'g',
    ['Ĝ'] = 'G',    ['ĝ'] = 'g',
    ['Ġ'] = 'G',    ['ġ'] = 'g',
    ['Ḡ'] = 'G',    ['ḡ'] = 'g',
    ['ʛ'] = 'G',    ['ɠ'] = 'g',
                    ['ɡ'] = 'g',
                    ['ɣ'] = 'g',

    -- H
    ['Ḫ'] = 'H',    ['ḫ'] = 'h',
    ['Ĥ'] = 'H',    ['ĥ'] = 'h',
    ['Ḥ'] = 'H',    ['ḥ'] = 'h',
    ['Ħ'] = 'H',    ['ħ'] = 'h',
                    ['ɦ'] = 'h',
                    ['ẖ'] = 'h',
                    ['ɧ'] = 'h',
                    ['ɥ'] = 'h',
                    ['ʮ'] = 'h',
                    ['ʯ'] = 'h',

    -- I
    ['Í'] = 'I',    ['í'] = 'i',
    ['Ĭ'] = 'I',    ['ĭ'] = 'i',
    ['Ǐ'] = 'I',    ['ǐ'] = 'i',
    ['Î'] = 'I',    ['î'] = 'i',
    ['Ï'] = 'I',    ['ï'] = 'i',
    ['İ'] = 'I',
    ['Ị'] = 'I',    ['ị'] = 'i',
    ['Ì'] = 'I',    ['ì'] = 'i',
    ['Ỉ'] = 'I',    ['ỉ'] = 'i',
    ['Ī'] = 'I',    ['ī'] = 'i',
    ['Į'] = 'I',    ['į'] = 'i',
    ['Ĩ'] = 'I',    ['ĩ'] = 'i',
    ['Ĳ'] = 'IJ',   ['ĳ'] = 'i',
                    ['ɨ'] = 'i',
                    ['ɩ'] = 'i',
                    ['ı'] = 'i',

    -- J
    ['Ĵ'] = 'J',    ['ĵ'] = 'j',
                    ['ǰ'] = 'j',
                    ['ʝ'] = 'j',
                    ['ȷ'] = 'j',
                    ['ʄ'] = 'j',
                    ['ɟ'] = 'j',

    -- K
    ['Ķ'] = 'K',    ['ķ'] = 'k',
    ['Ḳ'] = 'K',    ['ḳ'] = 'k',
    ['Ƙ'] = 'K',    ['ƙ'] = 'k',
    ['Ḵ'] = 'K',    ['ḵ'] = 'k',
                    ['ĸ'] = 'k',
                    ['ʞ'] = 'k',

    -- L
    ['Ĺ'] = 'L',    ['ĺ'] = 'l',
    ['Ƚ'] = 'L',    ['ƚ'] = 'l',
                    ['ɬ'] = 'l',
    ['Ľ'] = 'L',    ['ľ'] = 'l',
    ['Ļ'] = 'L',    ['ļ'] = 'l',
    ['Ḽ'] = 'L',    ['ḽ'] = 'l',
    ['Ḷ'] = 'L',    ['ḷ'] = 'l',
    ['Ḹ'] = 'L',    ['ḹ'] = 'l',
    ['Ḻ'] = 'L',    ['ḻ'] = 'l',
    ['Ŀ'] = 'L',    ['ŀ'] = 'l',
                    ['ɫ'] = 'l',
                    ['ɭ'] = 'l',
    ['Ǉ'] = 'LJ',
    ['ǈ'] = 'Lj',   ['ǉ'] = 'lj',
    ['Ł'] = 'L',    ['ł'] = 'l',
                    ['ƛ'] = 'l',
                    ['ɮ'] = 'l', -- LEZH
                    ['ʪ'] = 'ls',
                    ['ʫ'] = 'lz',

    -- M
    ['Ḿ'] = 'M',    ['ḿ'] = 'm',
    ['Ṁ'] = 'M',    ['ṁ'] = 'm',
    ['Ṃ'] = 'M',    ['ṃ'] = 'm',
                    ['ɱ'] = 'm',
                    ['ɯ'] = 'm',
                    ['ɰ'] = 'm',

    -- N
    ['Ń'] = 'N',    ['ń'] = 'n',
    ['Ň'] = 'N',    ['ň'] = 'n',
    ['Ņ'] = 'N',    ['ņ'] = 'n',
    ['Ṋ'] = 'N',    ['ṋ'] = 'n',
    ['Ṅ'] = 'N',    ['ṅ'] = 'n',
    ['Ṇ'] = 'N',    ['ṇ'] = 'n',
    ['Ǹ'] = 'N',    ['ǹ'] = 'n',
    ['Ɲ'] = 'N',    ['ɲ'] = 'n',
    ['Ṉ'] = 'N',    ['ṉ'] = 'n',
    ['Ǌ'] = 'NJ',
    ['ǋ'] = 'Nj',   ['ǌ'] = 'nj',
    ['Ñ'] = 'N',    ['ñ'] = 'n',
    ['Ŋ'] = 'N', -- ENG
                    ['ŉ'] = 'n',
                    ['ɳ'] = 'n',
                    ['ŋ'] = 'n',

    -- O
    ['Ó'] = 'O',    ['ó'] = 'o',
    ['Ŏ'] = 'O',    ['ŏ'] = 'o',
    ['Ǒ'] = 'O',    ['ǒ'] = 'o',
    ['Ô'] = 'O',    ['ô'] = 'o',
    ['Ố'] = 'O',    ['ố'] = 'o',
    ['Ộ'] = 'O',    ['ộ'] = 'o',
    ['Ồ'] = 'O',    ['ồ'] = 'o',
    ['Ổ'] = 'O',    ['ổ'] = 'o',
    ['Ỗ'] = 'O',    ['ỗ'] = 'o',
    ['Ö'] = 'O',    ['ö'] = 'o',
    ['Ọ'] = 'O',    ['ọ'] = 'o',
    ['Ő'] = 'O',    ['ő'] = 'o',
    ['Ò'] = 'O',    ['ò'] = 'o',
    ['Ỏ'] = 'O',    ['ỏ'] = 'o',
    ['Ơ'] = 'O',    ['ơ'] = 'o',
    ['Ớ'] = 'O',    ['ớ'] = 'o',
    ['Ợ'] = 'O',    ['ợ'] = 'o',
    ['Ờ'] = 'O',    ['ờ'] = 'o',
    ['Ở'] = 'O',    ['ở'] = 'o',
    ['Ỡ'] = 'O',    ['ỡ'] = 'o',
    ['Ō'] = 'O',    ['ō'] = 'o',
    ['Ɵ'] = 'O',    ['ɵ'] = 'o',
    ['Ǫ'] = 'O',    ['ǫ'] = 'o',
    ['Ø'] = 'O',    ['ø'] = 'o',
    ['Ǿ'] = 'O',    ['ǿ'] = 'o',
    ['Õ'] = 'O',    ['õ'] = 'o',
    ['Œ'] = 'OE',   ['œ'] = 'oe',
                    ['ɶ'] = 'OE',
                    ['ɔ'] = 'o',
                    ['ʘ'] = 'o',

    -- P
    ['Þ'] = 'P',    ['þ'] = 'p', -- THORN
                    ['ɸ'] = 'p', -- PHI

    -- Q
                    ['ʠ'] = 'q',

    -- R
    ['Ŕ'] = 'R',    ['ŕ'] = 'r',
    ['Ř'] = 'R',    ['ř'] = 'r',
    ['Ŗ'] = 'R',    ['ŗ'] = 'r',
    ['Ṙ'] = 'R',    ['ṙ'] = 'r',
    ['Ṛ'] = 'R',    ['ṛ'] = 'r',
    ['Ṝ'] = 'R',    ['ṝ'] = 'r',
    ['Ṟ'] = 'R',    ['ṟ'] = 'r',
    ['ʁ'] = 'R',
                    ['ɾ'] = 'r',
                    ['ɼ'] = 'r',
                    ['ɽ'] = 'r',
                    ['ɿ'] = 'r',
                    ['ɹ'] = 'r',
                    ['ɻ'] = 'r',
                    ['ɺ'] = 'r',

    -- S
    ['Ś'] = 'S',    ['ś'] = 's',
    ['Š'] = 'S',    ['š'] = 's',
    ['Ş'] = 'S',    ['ş'] = 's',
    ['Ŝ'] = 'S',    ['ŝ'] = 's',
    ['Ș'] = 'S',    ['ș'] = 's',
    ['Ṡ'] = 'S',    ['ṡ'] = 's',
    ['Ṣ'] = 'S',    ['ṣ'] = 's',
    ['ẞ'] = 'S',    ['ß'] = 's',
                    ['ʂ'] = 's',

    -- T
    ['Ť'] = 'T',    ['ť'] = 't',
    ['Ţ'] = 'T',    ['ţ'] = 't',
    ['Ṱ'] = 'T',    ['ṱ'] = 't',
    ['Ț'] = 'T',    ['ț'] = 't',
    ['Ṭ'] = 'T',    ['ṭ'] = 't',
    ['Ṯ'] = 'T',    ['ṯ'] = 't',
    ['Ŧ'] = 'T',    ['ŧ'] = 't',
                    ['ʨ'] = 'tc',
                    ['ʧ'] = 'ts', -- TESH
                    ['ʦ'] = 'ts',
                    ['ʇ'] = 't',
                    ['ʈ'] = 't',
                    ['ẗ'] = 't',
    -- U
    ['Ú'] = 'U',    ['ú'] = 'u',
    ['Ŭ'] = 'U',    ['ŭ'] = 'u',
    ['Ǔ'] = 'U',    ['ǔ'] = 'u',
    ['Û'] = 'U',    ['û'] = 'u',
    ['Ü'] = 'U',    ['ü'] = 'u',
    ['Ǘ'] = 'U',    ['ǘ'] = 'u',
    ['Ǚ'] = 'U',    ['ǚ'] = 'u',
    ['Ǜ'] = 'U',    ['ǜ'] = 'u',
    ['Ǖ'] = 'U',    ['ǖ'] = 'u',
    ['Ụ'] = 'U',    ['ụ'] = 'u',
    ['Ű'] = 'U',    ['ű'] = 'u',
    ['Ù'] = 'U',    ['ù'] = 'u',
    ['Ủ'] = 'U',    ['ủ'] = 'u',
    ['Ư'] = 'U',    ['ư'] = 'u',
    ['Ứ'] = 'U',    ['ứ'] = 'u',
    ['Ự'] = 'U',    ['ự'] = 'u',
    ['Ừ'] = 'U',    ['ừ'] = 'u',
    ['Ử'] = 'U',    ['ử'] = 'u',
    ['Ữ'] = 'U',    ['ữ'] = 'u',
    ['Ū'] = 'U',    ['ū'] = 'u',
    ['Ų'] = 'U',    ['ų'] = 'u',
    ['Ů'] = 'U',    ['ů'] = 'u',
    ['Ũ'] = 'U',    ['ũ'] = 'u',
                    ['ʊ'] = 'u', -- UPSILON
                    ['ʉ'] = 'u',

    -- V
                    ['ʋ'] = 'v',
                    ['ʌ'] = 'v',

    -- W
    ['Ẃ'] = 'W',    ['ẃ'] = 'w',
    ['Ŵ'] = 'W',    ['ŵ'] = 'w',
    ['Ẅ'] = 'W',    ['ẅ'] = 'w',
    ['Ẁ'] = 'W',    ['ẁ'] = 'w',
    ['ʬ'] = 'W',
                    ['ʍ'] = 'w',

    -- Y
    ['Ý'] = 'Y',    ['ý'] = 'y',
    ['Ŷ'] = 'Y',    ['ŷ'] = 'y',
    ['Ÿ'] = 'Y',    ['ÿ'] = 'y',
    ['Ẏ'] = 'Y',    ['ẏ'] = 'y',
    ['Ỵ'] = 'Y',    ['ỵ'] = 'y',
    ['Ỳ'] = 'Y',    ['ỳ'] = 'y',
    ['Ƴ'] = 'Y',    ['ƴ'] = 'y',
    ['Ỷ'] = 'Y',    ['ỷ'] = 'y',
    ['Ȳ'] = 'Y',    ['ȳ'] = 'y',
    ['Ỹ'] = 'Y',    ['ỹ'] = 'y',
                    ['ʎ'] = 'y',

    -- Z
    ['Ź'] = 'Z',    ['ź'] = 'z',
    ['Ž'] = 'Z',    ['ž'] = 'z',
    ['Ż'] = 'Z',    ['ż'] = 'z',
    ['Ẓ'] = 'Z',    ['ẓ'] = 'z',
    ['Ẕ'] = 'Z',    ['ẕ'] = 'z',
    ['Ƶ'] = 'Z',    ['ƶ'] = 'z',
                    ['ʐ'] = 'z',
                    ['ʑ'] = 'z',
};

function LibDiacritics:Replace(str)
    str = str or '';

    return string.gsub(str, "[%z\1-\127\194-\244][\128-\191]*", Diacritics);
end

return LibDiacritics;